[
  {
    "text": "UNIT I DATA COMMUNICATION AND NETWORKING\n\nData communication systems – Components and their functions - Building networks – Hosts and Networking devices – Switched Networks and Broadcast Networks – Transmission medium -Networking Devices: Hubs, Bridges, Switches, Routers, and Gateways - Edge, Access and Core networks – Role of software and hardware in networking – Layered Architecture OSI and TCP/IP Reference Models"
  },
  {
    "text": "Topic: Transmission medium -Networking Devices: Hubs, Bridges, Switches, Routers, and Gateways - Edge, Access and Core networks"
  },
  {
    "text": "Topic: Layered Architecture OSI and TCP/IP Reference Models"
  },
  {
    "text": "UNIT II PHYSICAL AND DATA LINK LAYERS\n\nWired and wireless media – Functions of physical layer – Modems – Transmission errors – Error detection and correction – Framing - Flow control – Sublayers of DLL – Broadcast networks – Collision Domain - Ethernet – CSMA/CD – Token Ring – VLAN – LAN Analyzer – IEEE 802.11 WLAN – CSMA/CA – Bluetooth – Ad hoc networks."
  },
  {
    "text": "UNIT III NETWORK LAYER\n\nPacket switching - Routing – Distance Vector and Link State Algorithms – RIP, OSPF and BGP - IPV4 Packet Format and Addressing – Effective IP address management techniques – Subnetting – CIDR – VLSM – DHCP – NAT – ICMP – Need for IPv6 – Addressing methods and types in IPv6– IPv6 header – Advantages of IPv6 – Transition from IPv4 to IPv6."
  },
  {
    "text": "Topic: RIP, OSPF and BGP - IPV4 Packet Format and Addressing"
  },
  {
    "text": "UNIT IV TRANSPORT AND APPLICATION LAYERS\n\nTransport Layer functions – End to end semantics – Functions of transport layer - User Datagram Protocol – UDP Applications – Transmission Control Protocol – Connection establishment and release – Flow Control – Retransmission Strategies – Congestion Control – Application layer – Sockets – Protocols – HTTP – FTP Email Protocols – DNS."
  },
  {
    "text": "Topic: Functions of transport layer - User Datagram Protocol"
  },
  {
    "text": "UNIT V NETWORK MONITORING AND MANAGEMENT\n\nNetwork centric operations - Network monitoring – Open-source network monitoring tools – Network management model – Abstract Syntax Notation – Overview of MIB and SNMP – Wireshark tool – Network provisioning – Fault detection, location and isolation – Data plane and control plane management using SDN concepts."
  },
  {
    "text": "Topic: Data plane and control plane management using SDN concepts."
  }
]